package by.Marafon_Alisher_2021.Java.Lesson3;

import java.util.Scanner;



/*2. Реализовать программу, которая пока работает, принимает на вход 
 * от пользователя два числа - делимое и делитель. Для этих двух чисел
 *  программа рассчитывает результат деления и выводит его в консоль.
 *   Программа останавливает свою работу тогда, когда пользователь вводит
 *    0 в качестве делителя.
(для этих вещественных чисел необходимо использовать тип double и метод 
nextDouble() у Scanner’а соответственно). В решении обязательно использовать оператор break.

Пример:
1 2 - ваш ввод в консоль
0.5 - ответ программы
100 77 - ваш ввод в консоль
1.2987012987012987 - ответ программы
3 0 - ваш ввод в консоль
работа программы завершается
*/

public class Task02 {

	public static void main(String[] args) {
		while(true){
			Scanner in = new Scanner(System.in);
			System.out.println("Введите делитель: ");
			double t = in.nextDouble();
			
			System.out.println("Введите делимое: ");
			double k = in.nextDouble();
			
			if(k == 0)
				break;
			
			System.out.println("Результат деления = " + t / k);
			
		}

	}

}
